app/controllers/admins/employees_controller.rb

UPDATE "employees" SET "name" = ?, "address" = ?, "city" = ?, "state" = ?, "pincode" = ?, "blood_group" = ?, "contact_no" = ?, "designation" = ?, "technology" = ?, "document" = ?, "encrypted_password" = ?, "dob" = ?, "updated_at" = ? WHERE "employees"."id" = ?
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? ORDER BY "employees"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_employee
      @employee = Employee.find(params[:id])