app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? ORDER BY "employees"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_employee
      @employee = Employee.find(params[:id])